#+TITLE: Medidas de la desigualdad de la renta --- Soluciones
#+SETUPFILE: ../setup.org


#+latex: \setcounter{section}{4}

* Datos :noexport:

#+INCLUDE: "../build/ineq-data.org" :minlevel 1


* Ejercicios

#+begin_tcolorbox
#+ATTR_LATEX: :options [1., series = questions]
1. En la hoja =Rentas= del archivo Excel =ineq-data.xlsx= se presentan
   las rentas anuales en euros de los 10 habitantes de un país
   hipotético.

   #+ATTR_LATEX: :options [(a)]
   a) Obtenga y represente gráficamente la curva de Lorenz.
#+end_tcolorbox

#+begin_center
#+latex: \small%
#+ATTR_LATEX: :booktabs t :align >{$}r<{$}*{4}{>{$}w{r}{2cm}<{$}}
|           i | y_{i} | y_{i} / @@latex: \sum y_i@@ | p         | L(p)        |
|-------------+-------+-----------------------------+-----------+-------------|
|           0 |     0 | \pct{0.0}                   | \pct{0}   | \pct{0.0}   |
|           1 |     5 | \pct{1.9}                   | \pct{10}  | \pct{1.9}   |
|           2 |    10 | \pct{4.5}                   | \pct{20}  | \pct{6.5}   |
|           3 |    12 | \pct{5.2}                   | \pct{30}  | \pct{11.7}  |
|           4 |    15 | \pct{6.5}                   | \pct{40}  | \pct{18.2}  |
|           5 |    17 | \pct{7.8}                   | \pct{50}  | \pct{26.0}  |
|           6 |    20 | \pct{9.1}                   | \pct{60}  | \pct{35.1}  |
|           7 |    22 | \pct{11.0}                  | \pct{70}  | \pct{46.1}  |
|           8 |    26 | \pct{13.0}                  | \pct{80}  | \pct{59.1}  |
|           9 |    32 | \pct{16.2}                  | \pct{90}  | \pct{75.3}  |
|          10 |    48 | \pct{24.7}                  | \pct{100} | \pct{100.0} |
|-------------+-------+-----------------------------+-----------+-------------|
| \text{Suma} |   207 |                             |           |             |
#+TBLFM: @2$2..@13$2=remote(tab-lorenz-data, @@#$2)
#+TBLFM: @2$3..@12$3='(concat "\\pct{" remote(tab-lorenz-data, @@#$3) "}")
#+TBLFM: @2$4..@12$4='(concat "\\pct{" remote(tab-lorenz-data, @@#$4) "}")
#+TBLFM: @2$3..@12$5='(concat "\\pct{" remote(tab-lorenz-data, @@#$5) "}")
#+end_center

Curva de Lorenz:
#+begin_center
#+include: "../tex/ineq-fig-lorenz2.tex" export latex
#+end_center


#+begin_tcolorbox
   #+ATTR_LATEX: :options [(a), series = inner, start = 2, leftmargin=1.8cm]
   b) <<item:b>>Calcule el índice de Gini y el cociente /S80S20/.
#+end_tcolorbox

#+ATTR_LATEX: :options {0.4\textwidth}
#+begin_minipage
#+latex: \small%
#+ATTR_LATEX: :center nil :booktabs t :align >{$}r<{$}*{2}{>{$}w{r}{1cm}<{$}}
|           i | y_{i} | @@latex:i \cdot y_{i}@@ |
|-------------+-------+-------------------------|
|           1 |     5 |                       5 |
|           2 |    10 |                      20 |
|           3 |    12 |                      36 |
|           4 |    15 |                      60 |
|           5 |    17 |                      85 |
|           6 |    20 |                     120 |
|           7 |    22 |                     154 |
|           8 |    26 |                     208 |
|           9 |    32 |                     288 |
|          10 |    48 |                     480 |
|-------------+-------+-------------------------|
| \text{Suma} |   207 |                    1456 |
#+TBLFM: @2$2 = remote(tab-lorenz-data, @3$2)
#+TBLFM: @3$2 = remote(tab-lorenz-data, @4$2)
#+TBLFM: @4$2 = remote(tab-lorenz-data, @5$2)
#+TBLFM: @5$2 = remote(tab-lorenz-data, @6$2)
#+TBLFM: @6$2 = remote(tab-lorenz-data, @7$2)
#+TBLFM: @7$2 = remote(tab-lorenz-data, @8$2)
#+TBLFM: @8$2 = remote(tab-lorenz-data, @9$2)
#+TBLFM: @9$2 = remote(tab-lorenz-data, @10$2)
#+TBLFM: @10$2 = remote(tab-lorenz-data, @11$2)
#+TBLFM: @11$2 = remote(tab-lorenz-data, @12$2)
#+TBLFM: @>$2=vsum(@I..II-1)
#+TBLFM: @2$3..@12$3=$-1 * $-2
#+TBLFM: @>$3=vsum(@I..II-1)
#+end_minipage
#+ATTR_LATEX: :options {0.6\textwidth}
#+begin_minipage
Índice de Gini:
#+begin_export latex
\[
  G = \frac{2}{N} \frac{\sum i y_i}{\sum y_i} - \frac{N+1}{N} =
  \frac{2}{10} \frac{1456}{207} - \frac{11}{10} = 0.307.
\]
#+end_export

Índice /S80S20/:
#+begin_export latex
\[
  \text{\emph{S80S20}} = \frac{32 + 48}{10 + 5} = 5.33.
\]
#+end_export
#+end_minipage


#+begin_tcolorbox
   #+ATTR_LATEX: :options [resume* = inner]
   c) <<item:c>>Calcule el índice de Gini y el cociente /S80S20/ cuando se
      transfieren \money{2 000} del individuo 1 al individuo 3. ¿Cómo
      cambian los indicadores de desigualdad?
#+end_tcolorbox

#+ATTR_LATEX: :options {0.4\textwidth}
#+begin_minipage
#+latex: \small%
#+ATTR_LATEX: :center nil :booktabs t :align >{$}r<{$}*{2}{>{$}w{r}{1cm}<{$}}
|           i | y_{i} | @@latex:i \cdot y_{i}@@ |
|-------------+-------+-------------------------|
|           1 |     3 |                       3 |
|           2 |    10 |                      20 |
|           3 |    14 |                      42 |
|           4 |    15 |                      60 |
|           5 |    17 |                      85 |
|           6 |    20 |                     120 |
|           7 |    22 |                     154 |
|           8 |    26 |                     208 |
|           9 |    32 |                     288 |
|          10 |    48 |                     480 |
|-------------+-------+-------------------------|
| \text{Suma} |   207 |                    1460 |
#+TBLFM: @2$2 = remote(tab-lorenz-data, @3$2) - 2
#+TBLFM: @3$2 = remote(tab-lorenz-data, @4$2)
#+TBLFM: @4$2 = remote(tab-lorenz-data, @5$2) + 2
#+TBLFM: @5$2 = remote(tab-lorenz-data, @6$2)
#+TBLFM: @6$2 = remote(tab-lorenz-data, @7$2)
#+TBLFM: @7$2 = remote(tab-lorenz-data, @8$2)
#+TBLFM: @8$2 = remote(tab-lorenz-data, @9$2)
#+TBLFM: @9$2 = remote(tab-lorenz-data, @10$2)
#+TBLFM: @10$2 = remote(tab-lorenz-data, @11$2)
#+TBLFM: @11$2 = remote(tab-lorenz-data, @12$2)
#+TBLFM: @>$2=vsum(@I..II-1)
#+TBLFM: @2$3..@12$3=$-1 * $-2
#+TBLFM: @>$3=vsum(@I..II-1)
#+end_minipage
#+ATTR_LATEX: :options {0.6\textwidth}
#+begin_minipage
Índice de Gini:
#+begin_export latex
\[
  G = \frac{2}{N} \frac{\sum i y_i}{\sum y_i} - \frac{N+1}{N} =
  \frac{2}{10} \frac{1460}{207} - \frac{11}{10} = 0.311.
\]
#+end_export

Índice /S80S20/:
#+begin_export latex
\[
  \text{\emph{S80S20}} = \frac{32 + 48}{10 + 3} = 6.15.
\]
#+end_export
#+end_minipage



#+begin_tcolorbox
   #+ATTR_LATEX: :options [resume* = inner]
   d) <<item:d>>Calcule el índice de Gini y el cociente /S80S20/ si se
      transfieren \money{2 000} del individuo 8 al individuo 10. ¿Cómo
      cambian ahora los indicadores de desigualdad?
#+end_tcolorbox

#+ATTR_LATEX: :options {0.4\textwidth}
#+begin_minipage
#+latex: \small%
#+ATTR_LATEX: :center nil :booktabs t :align >{$}r<{$}*{2}{>{$}w{r}{1cm}<{$}}
|           i | y_{i} | @@latex:i \cdot y_{i}@@ |
|-------------+-------+-------------------------|
|           1 |     5 |                       5 |
|           2 |    10 |                      20 |
|           3 |    12 |                      36 |
|           4 |    15 |                      60 |
|           5 |    17 |                      85 |
|           6 |    20 |                     120 |
|           7 |    22 |                     154 |
|           8 |    24 |                     192 |
|           9 |    32 |                     288 |
|          10 |    50 |                     500 |
|-------------+-------+-------------------------|
| \text{Suma} |   207 |                    1460 |
#+TBLFM: @2$2 = remote(tab-lorenz-data, @3$2)
#+TBLFM: @3$2 = remote(tab-lorenz-data, @4$2)
#+TBLFM: @4$2 = remote(tab-lorenz-data, @5$2)
#+TBLFM: @5$2 = remote(tab-lorenz-data, @6$2)
#+TBLFM: @6$2 = remote(tab-lorenz-data, @7$2)
#+TBLFM: @7$2 = remote(tab-lorenz-data, @8$2)
#+TBLFM: @8$2 = remote(tab-lorenz-data, @9$2)
#+TBLFM: @9$2 = remote(tab-lorenz-data, @10$2) - 2
#+TBLFM: @10$2 = remote(tab-lorenz-data, @11$2)
#+TBLFM: @11$2 = remote(tab-lorenz-data, @12$2) + 2
#+TBLFM: @>$2=vsum(@I..II-1)
#+TBLFM: @2$3..@12$3=$-1 * $-2
#+TBLFM: @>$3=vsum(@I..II-1)
#+end_minipage
#+ATTR_LATEX: :options {0.6\textwidth}
#+begin_minipage
Índice de Gini:
#+begin_export latex
\[
  G = \frac{2}{N} \frac{\sum i y_i}{\sum y_i} - \frac{N+1}{N} =
  \frac{2}{10} \frac{1460}{207} - \frac{11}{10} = 0.311.
\]
#+end_export

Índice /S80S20/:
#+begin_export latex
\[
  \text{\emph{S80S20}} = \frac{32 + 50}{10 + 5} = 5.47.
\]
#+end_export
#+end_minipage

#+begin_tcolorbox
   #+ATTR_LATEX: :options [resume* = inner]
   e) Compare las respuestas obtenidas en los dos apartados
      anteriores. ¿Cuál de los índices de desigualdad es más adecuado
      en este caso?
#+end_tcolorbox

Las redistribuciones que se plantean en los apartados [[item:c]] y [[item:d]]
son regresivas: se transfiere dinero de un individuo con menos renta a
otro con mayor renta. En ambos casos, los índices indican un
empeoramiento de la distribución de la renta con respecto a la
situación inicial del apartado [[item:b]].

Cuando comparamos la distribución de la renta de los apartados [[item:c]]
y [[item:d]] se obtienen resultados diferentes según el índice
considerado. Por un lado, el índice de Gini toma el mismo valor. Por
otro lado, el índice /S80S20/ muestra una mayor desigualdad en el
apartado [[item:c]].

Para comparar las transferencias que se han planteado antes es
preferible usar el índice /S80S20/ dado que es más sensible a cambios
en los extremos de la distribución. El índice de Gini no ofrece
información útil para este tipo de comparación.

#+latex: \clearpage{}

#+begin_tcolorbox
#+ATTR_LATEX: :options [resume* = questions]
2. En la hoja =CC.AA.= del archivo Excel =ineq-data.xlsx= se presentan
   datos de las Comunidades Autónomas españolas correspondientes a los
   años 2013 y 2023 y que muestran cómo ha evolucionado el crecimiento
   económico, la desigualdad de la renta y la pobreza en las distintas
   Comunidades. En su respuesta no incluya los casos de las Ciudades
   Autónomas de Ceuta y Melilla dado que presentan características muy
   diferentes al resto de España. También tenga en cuenta que las
   rentas medias no están ajustadas al incremento de los precios
   durante ese periodo. Para comparar las rentas medias en años
   diferentes es conveniente deflactarlas previamente con el
   IPC. Utilizando los datos proporcionados compruebe si existe alguna
   relación entre el crecimiento económico y la pobreza. ¿Disminuye
   más la pobreza en las Comunidades que crecen más? ¿Están
   relacionados el crecimiento y la desigualdad? ¿De qué forma? ¿Y la
   desigualdad y la pobreza?
#+end_tcolorbox

En cada uno de los gráficos que siguen se incluye una línea vertical y
otra horizontal que representan el valor para el conjunto de España de
la variable que se representa en el eje correspondiente.

El siguiente gráfico representa las tasas de riesgo de la pobreza en
el año 2013 (eje horizontal) y en el año 2023 (eje vertical).

#+ATTR_LATEX: :options [t]{0.3\textwidth}
#+begin_minipage
#+latex: \vspace{1ex}\small%
En general, los índices de pobreza han disminuido. Las comunidades que
tenían las tasas más elevadas en 2013 (Murcia, Extremadura, Andalucía,
Canarias, Comunidad Valenciana y Castilla-La Mancha) siguen situándose
por encima de la media española en 2023. En el resto del país, las
tasas de pobreza se mantienen por debajo de la media en ambos años.
#+end_minipage
#+ATTR_LATEX: :options [t]{0.7\textwidth}
#+begin_minipage
#+latex: \vspace{0pt}
#+ATTR_LATEX: :scale 0.46
[[file:../figures/H.pdf]]
#+end_minipage

#+latex: \clearpage{}
Se utiliza el índice de Gini para describir la evolución de la
desigualdad de la renta en España durante los años 2013 a 2023.

#+ATTR_LATEX: :options [t]{0.3\textwidth}
#+begin_minipage
#+latex: \vspace{1ex}\small%
En general, la desigualdad ha disminuido en todo el país. En 2023,
cuatro comunidades presentan un índice de Gini superior al promedio
nacional: Madrid, Comunidad Valenciana, Canarias y Andalucía. Esta
última ya registraba niveles de desigualdad por encima de la media
en 2013.
#+end_minipage
#+ATTR_LATEX: :options [t]{0.7\textwidth}
#+begin_minipage
#+latex: \vspace{0pt}
#+ATTR_LATEX: :scale 0.46
[[file:../figures/Gini.pdf]]
#+end_minipage

El siguiente gráfico muestra las tasas medias anuales de crecimiento
del riesgo de la pobreza (eje vertical) frente al crecimiento medio
anual de la renta (eje horizontal).

#+ATTR_LATEX: :options [t]{0.3\textwidth}
#+begin_minipage
#+latex: \vspace{1ex}\small%
Se observa una clara relación negativa entre ambas variables: las
comunidades con mayor crecimiento económico durante el periodo son
también las que han experimentado las mayores reducciones relativas en
sus tasas de pobreza.  tasas de pobreza.
#+end_minipage
#+ATTR_LATEX: :options [t]{0.7\textwidth}
#+begin_minipage
#+latex: \vspace{0pt}
#+ATTR_LATEX: :scale 0.46
[[file:../figures/ypc_H.pdf]]
#+end_minipage

#+latex: \clearpage{}
En el siguiente gráfico se relacionan las tasas de crecimiento medias
anuales del índice de Gini (eje vertical) y de la renta (eje
horizontal).

#+ATTR_LATEX: :options [t]{0.3\textwidth}
#+begin_minipage
#+latex: \vspace{1ex}\small%
Durante el periodo analizado, no se aprecia una relación sistemática
entre el crecimiento de la renta y la evolución de la desigualdad.
#+end_minipage
#+ATTR_LATEX: :options [t]{0.7\textwidth}
#+begin_minipage
#+latex: \vspace{0pt}
#+ATTR_LATEX: :scale 0.46
[[file:../figures/ypc_Gini.pdf]]
#+end_minipage

Finalmente, se representa el crecimiento de las tasas de pobreza (eje
vertical) y el de los índices de Gini (eje horizontal).

#+ATTR_LATEX: :options [t]{0.3\textwidth}
#+begin_minipage
#+latex: \vspace{1ex}\small%
Aparentemente, existe una relación positiva entre el crecimiento de
ambos indicadores. No obstante, si se excluye el caso atípico de
Navarra, la asociación entre pobreza y desigualdad desaparece.
#+end_minipage
#+ATTR_LATEX: :options [t]{0.7\textwidth}
#+begin_minipage
#+latex: \vspace{0pt}
#+ATTR_LATEX: :scale 0.46
[[file:../figures/Gini_H.pdf]]
#+end_minipage

En conclusión, el crecimiento de la renta durante el periodo analizado
ha ido acompañado de una disminución de las tasas de riesgo de
pobreza. Aunque la desigualdad en la distribución también se ha
reducido en términos generales, no se han encontrado relaciones
sistemáticas entre la evolución de la desigualdad y el crecimiento
económico o la variación de las tasas de la pobreza.



# Local Variables:
# ispell-local-dictionary: "spanish"
# End:

#  LocalWords:  Andalucía
